Revit 2027 API
Marble.MarbleWidth Property
 The property labeled "Vein Width" from the "Marble" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MarbleWidth { get; }
Public Shared ReadOnly Property MarbleWidth As String
	Get
public:
static property String^ MarbleWidth {
	String^ get ();
}
static member MarbleWidth : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
Reference
Marble Class
Autodesk.Revit.DB.Visual Namespace